CSI API ETABS v1
cPropRebar.GetNameList Method
 Retrieves the names of all defined rebar properties
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetNameList(
	ref int NumberNames,
	ref string[] MyName
)
Function GetNameList (
	ByRef NumberNames As Integer,
	ByRef MyName As String()
) As Integer
Dim instance As cPropRebar
Dim NumberNames As Integer
Dim MyName As String()
Dim returnValue As Integer
returnValue = instance.GetNameList(NumberNames,
	MyName)
int GetNameList(
	int% NumberNames,
	array<String^>^% MyName
)
abstract GetNameList :
        NumberNames : int byref *
        MyName : string[] byref -> int
Parameters
NumberNames
Type: System.Int32
 The number of rebar properties
MyName
Type: System.String[]
 This is a one-dimensional array of rebar property names. The MyName array is created as a dynamic, zero-based, array by the API user:
Dim MyName() as String
 The array is dimensioned to (NumberNames – 1) inside the ETABS program, filled with the names, and returned to the API user.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved, otherwise it returns nonzero
Remarks
See Also
Reference
cPropRebar Interface
ETABSv1 Namespace